; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	thermograph4 - mode
	image2 - mode
	image5 - mode
	Star1 - direction
	Star0 - direction
	Phenomenon2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Star5 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(supports instrument0 image5)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon2 image5)
	(have_image Phenomenon2 spectrograph1)
	(have_image Star3 spectrograph3)
	(have_image Phenomenon4 image2)
	(have_image Phenomenon4 thermograph0)
	(have_image Star5 image5)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 phenomenon2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon2)
   goals met: 0 of 6
4. (take_image satellite0 phenomenon2 instrument0 image5)
   added: (have_image phenomenon2 image5)
   goals met: 1 of 6
5. (take_image satellite0 phenomenon2 instrument0 spectrograph1)
   added: (have_image phenomenon2 spectrograph1)
   goals met: 2 of 6
6. (turn_to satellite0 phenomenon4 phenomenon2)
   deleted: (pointing satellite0 phenomenon2)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 6
7. (take_image satellite0 phenomenon4 instrument0 image2)
   added: (have_image phenomenon4 image2)
   goals met: 3 of 6
8. (take_image satellite0 phenomenon4 instrument0 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 4 of 6
9. (turn_to satellite0 star3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star3)
   goals met: 4 of 6
10. (take_image satellite0 star3 instrument0 spectrograph3)
   added: (have_image star3 spectrograph3)
   goals met: 5 of 6
11. (turn_to satellite0 star5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star5)
   goals met: 5 of 6
12. (take_image satellite0 star5 instrument0 image5)
   added: (have_image star5 image5)
   goals met: 6 of 6
